kennyrob26/A7670_Library_for_STM32/Inc/AT_decoder.h
/*
 * AT_decoder.h
 *
 *  Created on: Sep 4, 2025
 *      Author: kenny
 */

#ifndef INC_AT_DECODER_H_
#define INC_AT_DECODER_H_

#include "string.h"
#include "stdint.h"
#include "stm32g4xx_hal.h"

//#define AT_OK 1
//#define AT_ERROR 0

#define STATE_SEND_COMMAND 0
#define STATE_RECEIVE_COMMAND 1
#define STATE_WAIT_COMMAND 2



#define TAMANHO_MENSAGEM 100
#define TIMEOUT 50

typedef enum
{
	AT_OK      = 0,		//OK     -> Tudo correu como o esperado
	AT_ERROR   = 1,		//ERROR  -> Algo deu errado
	AT_WAITING = 2,		//WAITING-> Estamos esperando a tarefa ser conclida
	AT_TIMEOUT = 3		//TIMEOUT-> O tempo para executar a tarefa estourou
}AT_Status;

typedef struct AT_INFO
{
	char at_command[50];
	volatile uint8_t response_buffer[TAMANHO_MENSAGEM];
    char *echo;
    char *response;
    char *OK;
    uint8_t status;
    volatile uint8_t existMessage;
}AT_INFO;


typedef struct AT_Wait_Response
{
	uint32_t start_tick;
	uint32_t timeout;
	char expected_response[30];
	uint8_t waiting_status;
}AT_Wait_Response;

AT_Status AT_processCommand(UART_HandleTypeDef *huartx, AT_INFO *at);
AT_Status AT_config_Wait_Response(AT_Wait_Response *wait_response, const char *expected_response, uint32_t timeout);
AT_Status AT_check_Wait_Response(AT_Wait_Response *wait_response, AT_INFO *at);
AT_Status AT_check_Wait_Response_Blocking(AT_Wait_Response *wait_response, AT_INFO *at);
AT_Status AT_sendCommand(UART_HandleTypeDef *huartx, AT_INFO *at);
AT_Status AT_responseCommand(AT_INFO *at);



#endif /* INC_AT_DECODER_H_ */
